Repository: FlickerSoul/CraftPortal
Catalog: CraftPortal/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

source: Accounts
zh_hans: 账户
zh_hant: 帳戶

source: Add a JVM path to be used to launch the game.
zh_hans: 添加用于游戏的 JVM 路径
zh_hant: 新增一個 JVM 路徑來啟動遊戲。

source: Add a microsoft account
zh_hans: 添加微软账户
zh_hant: 新增 Microsoft 帳戶

source: Add a offline account
zh_hans: 添加离线账户
zh_hant: 新增離線帳戶

source: Add Directory
zh_hans: 添加目录
zh_hant: 新增目錄

source: Add new games or mods
zh_hans: 增加游戏或者 Mods
zh_hant: 新增遊戲或模組

source: Advanced
zh_hans: 高级选项
zh_hant: 進階

source: Are you sure to delete this profile
zh_hans: 你确定想要删除此游戏吗
zh_hant: 您確定要刪除此檔案嗎？

source: Automatic
zh_hans: 自动
zh_hant: 自動

source: Available Directories
zh_hans: 已有的游戏目录
zh_hant: 可用目錄

source: Available JVMs
zh_hans: 已有的 JVM
zh_hant: 可用的 JVM

source: Back
zh_hans: 后退
zh_hant: 返回

source: Cancel
zh_hans: 取消
zh_hant: 取消

source: Check game profile
zh_hans: 检查游戏内容

source: Check player information
zh_hans: 检查玩家信息

source: Click here to add an account
zh_hans: 点此添加游戏账户
zh_hant: 點擊此處新增帳戶

source: Close
zh_hans: 关闭
zh_hant: 關閉

source: Contacting Microsoft...
zh_hans: 正在连接微软服务器...
zh_hant: 正在聯絡 Microsoft…

source: Continue
zh_hans: 继续

source: Current Game Directory
zh_hans: 当前游戏目录
zh_hant: 當前遊戲目錄

source: Delete
zh_hans: 删除
zh_hant: 刪除

source: Delete Game Profile
zh_hans: 删除游戏
zh_hant: 刪除遊戲檔案

source: Discover Game Profiles
zh_hans: 自动添加已有的游戏
zh_hant: 自動檢測遊戲檔案

source: Discover JVM paths that can be used to launch the game.
zh_hans: 自动添加可用的 JVM
zh_hant: 自動檢測可用的 JVM 路徑

source: Discover playable game profiles
zh_hans: 自动添加可用的游戏
zh_hant: 自動檢測可玩的遊戲檔案

source: Execute launch script
zh_hans: 执行启动脚本

source: Folder Structure Style
zh_hans: 游戏目录结构
zh_hant: 目錄結構樣式

source: Fullscreen
zh_hans: 全屏
zh_hant: 全螢幕

source: Game Library
zh_hans: 游戏目录
zh_hant: 遊戲資料庫

source: Game Settings
zh_hans: 游戏设置
zh_hant: 遊戲設定

source: Generate launch script
zh_hans: 生成启动脚本

source: Global Settings
zh_hans: 全剧设置
zh_hant: 全域設定

source: Go To Game Library
zh_hans: 前往游戏目录
zh_hant: 前往遊戲資料庫

source: Height
zh_hans: 屏高
zh_hant: 高度

source: Hide Logs
zh_hans: 隐藏日志

source: Home
zh_hans: 主页
zh_hant: 主頁

source: I completed login
zh_hans: 我已经登陆
zh_hant: 我已完成登錄

source: Internal State Error. Please contact the developer.
zh_hans: 内部状态错误。请联系开发者。
zh_hant: 內部狀態錯誤。請聯絡開發者。

source: Isolated
zh_hans: 分离

source: Java version: %@
zh_hans: Java 版本：%@
zh_hant: Java 版本：%@

source: Launch Game
zh_hans: 开始游戏
zh_hant: 啟動遊戲

source: Load Minecraft Metadata
zh_hans: 加载游戏元数据

source: Loaded %lld profiles
zh_hans: 已加载 %lld 游戏
zh_hant: 已載入 %lld 個檔案

source: Loading Your Minecraft Account
zh_hans: 正在加载我的世界账户
zh_hant: 正在載入 Minecraft 帳戶

source: Loading...
zh_hans: 加载中…
zh_hant: 載入中…

source: Login Through Microsoft With Device Code
zh_hans: 通过设别码登陆
zh_hant: 透過裝置代碼登入

source: Logs
zh_hans: 日志

source: Manage Games
zh_hans: 管理游戏
zh_hant: 管理遊戲

source: Mangled
zh_hans: 合并

source: Memory
zh_hans: 内存
zh_hant: 記憶體

source: No
zh_hans: 不
zh_hant: 不

source: No Accounts
zh_hans: 没有账户
zh_hant: 沒有帳戶

source: No Game Directory Selected
zh_hans: 无选中的游戏目录
zh_hant: 未選取遊戲目錄

source: No Game Selected
zh_hans: 无选中的游戏
zh_hant: 未選取遊戲

source: None
zh_hans: 无
zh_hant: 無

source: Ok
zh_hans: 好的
zh_hant: 好的

source: Once you completed login in the browser, click the button below to continue.
zh_hans: 当你在网页里完成登陆后，点击下面的按钮以继续
zh_hant: 當您在瀏覽器中完成登錄後，請點擊下方按鈕繼續。

# Open [%@](%@) and enter the following code:
source: Open [%1$@](%2$@) and enter the following code:
zh_hans: 打开网页 [%1$@](%2$@) 并且输入以下代码：
zh_hant: 打開[%1$@](%2$@)並輸入以下代碼：

source: Open Game Folder
zh_hans: 打开游戏文件夹
zh_hant: 打開遊戲資料夾

source: Open Saves Folder
zh_hans: 打开存档文件夹
zh_hant: 打開存檔資料夾

source: Resolution
zh_hans: 分辨率
zh_hant: 解析度

source: Select a game directory to add to the list of game directories.
zh_hans: 选择游戏目录并添加
zh_hant: 選擇遊戲目錄以添加至列表

source: Show Logs
zh_hans: 现实日志

source: The current game directory is not set. Please select a game directory first.
zh_hans: 当前游戏目录未设置。请先选择一个游戏目录。
zh_hant: 目前的遊戲目錄未設定。請先選取遊戲目錄。

source: There are already games lauched under the user name '%@'. Continue lauching new game intances may cause trouble for existing game plays. We are not responsible for any loss caused by this
zh_hans: 该玩家 (%@) 已经存在于游戏中。开启新游戏可能对已存在的游戏造成影响。我们对因此造成的损失不会负任何责任。

source: There is an error loading java versions
zh_hans: 加载 JVM 版本时遇到问题
zh_hant: 載入 JVM 版本時發生錯誤

source: Turn On Per Game Settings
zh_hans: 使用以下游戏设置
zh_hant: 啟用每遊戲設定

source: under the directory
zh_hans: 在以下文件路径
zh_hant: 在此目錄下

source: Use %@ as the current account?
zh_hans: 将 %@ 作为当前账号吗？

source: Use as Current Game Directory
zh_hans: 作为当前游戏目录
zh_hant: 作為當前遊戲目錄

source: Use as current JVM
zh_hans: 作为当前 JVM
zh_hant: 作為當前 JVM

source: Username
zh_hans: 用户名
zh_hant: 用戶名

source: Verify assets directory
zh_hans: 验证游戏资产文件

source: Verify game profile
zh_hans: 验证游戏本体

source: Verify Java Version
zh_hans: 验证 Java 版本

source: Verify libraries
zh_hans: 验证所需代码库

source: Warning
zh_hans: 警告

source: Width
zh_hans: 屏宽
zh_hant: 寬度
